# ðŸš¢Titanic | ðŸ”®a model that predicts which passengers survived the Titanic shipwreck

In [23]:
import pandas as pd

In [24]:
df=pd.read_csv("train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [25]:
df['Name'].head(20)

0                               Braund, Mr. Owen Harris
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
5                                      Moran, Mr. James
6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
11                             Bonnell, Miss. Elizabeth
12                       Saundercock, Mr. William Henry
13                          Andersson, Mr. Anders Johan
14                 Vestrom, Miss. Hulda Amanda Adolfina
15                     Hewlett, Mrs. (Mary D Kingcome)
16                                 Rice, Master. Eugene
17                         Williams, Mr. Charles Eugene
18    Vander Planke, Mrs. Julius (Emelia Maria Vande...
19                              Masselmani, Mrs. Fatima
Name: Name, dtype: object

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [27]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [28]:
bins = [0, 5, 13, 17, 26, 40, float('inf')]
labels = ['Baby', 'Kid', 'Teenager', 'Young Adult', 'Adult', 'Senior']

df['AgeCategory'] = pd.cut(df['Age'], bins=bins, labels=labels)

# Add 'Unknown' for missing values
df['AgeCategory'] = df['AgeCategory'].cat.add_categories(['Unknown'])
df['AgeCategory'] = df['AgeCategory'].fillna('Unknown')
df['AgeCategory'].value_counts()

AgeCategory
Adult          245
Young Adult    206
Unknown        177
Senior         150
Baby            44
Teenager        42
Kid             27
Name: count, dtype: int64

In [29]:
import re

def get_title(name):
    if pd.isna(name):
        return 'Neither'
    
    # Case-insensitive and precise matching
    if re.search(r'\bMrs\b', name, flags=re.IGNORECASE):
        return 'Mrs'
    elif re.search(r'\bMiss\b', name, flags=re.IGNORECASE):
        return 'Miss'
    elif re.search(r'\bMr\b', name, flags=re.IGNORECASE):
        return 'Mr'
    elif re.search(r'\bMaster\b', name, flags=re.IGNORECASE):
        return 'Master'
    elif re.search(r'\bDr\b', name, flags=re.IGNORECASE):
        return 'Dr'
    else:
        return 'Neither'

df['Title'] = df['Name'].apply(get_title)

for t in ['Mr', 'Mrs', 'Miss', 'Master', 'Dr', 'Neither']:
    subset = df[df['Title'] == t]
    print(f"\n=== Title: {t} â€” total rows: {len(subset)} ===")
    print("\nAgeCategory counts:")
    print(subset['AgeCategory'].value_counts(dropna=False).to_string())

=== Title: Mr â€” total rows: 518 ===

AgeCategory counts:
AgeCategory
Adult          154
Young Adult    133
Unknown        119
Senior          90
Teenager        21
Kid              1
Baby             0

=== Title: Mrs â€” total rows: 129 ===

AgeCategory counts:
AgeCategory
Adult          48
Senior         37
Young Adult    23
Unknown        17
Teenager        4
Kid             0
Baby            0

=== Title: Miss â€” total rows: 180 ===

AgeCategory counts:
AgeCategory
Young Adult    47
Adult          36
Unknown        36
Baby           21
Teenager       17
Kid            13
Senior         10

=== Title: Master â€” total rows: 40 ===

AgeCategory counts:
AgeCategory
Baby           23
Kid            13
Unknown         4
Teenager        0
Young Adult     0
Adult           0
Senior          0

=== Title: Dr â€” total rows: 7 ===

AgeCategory counts:
AgeCategory
Senior         4
Young Adult    1
Adult          1
Unknown        1
Teenager       0
Baby           0
Kid            0

=== Title: Neither â€” total rows: 17 ===

AgeCategory counts:
AgeCategory
Senior         9
Adult          6
Young Adult    2
Teenager       0
Kid            0
Baby           0
Unknown        0

In [30]:
# ...existing code...
# new cell - min/max age per title (and Neither)
titles = ['Mr', 'Mrs', 'Miss', 'Master', 'Dr']
masks = {t: df['Name'].str.contains(r'\b' + t + r'\b', na=False) for t in titles}
masks['Neither'] = ~df['Name'].str.contains(r'\b(?:Mr|Mrs|Miss|Master)\b', na=False)

stats = {}
for k, mask in masks.items():
    ages = df.loc[mask, 'Age'].dropna()
    stats[k] = {'count': int(mask.sum()), 'min_age': float(ages.min()) if not ages.empty else None, 'max_age': float(ages.max()) if not ages.empty else None}

stats_df = pd.DataFrame.from_dict(stats, orient='index')[['count', 'min_age', 'max_age']]
print(stats_df)
# ...existing code...

         count  min_age  max_age
Mr         518    11.00     80.0
Mrs        129    14.00     63.0
Miss       182     0.75     63.0
Master      40     0.42     12.0
Dr           7    23.00     54.0
Neither     24    23.00     70.0

In [31]:
# ...existing code...
# new cell - count and mean age per title (and Neither)
titles = ['Mr', 'Mrs', 'Miss', 'Master', 'Dr']
masks = {t: df['Name'].str.contains(r'\b' + t + r'\b', na=False) for t in titles}
masks['Neither'] = ~df['Name'].str.contains(r'\b(?:Mr|Mrs|Miss)\b', na=False)

stats = {}
for k, mask in masks.items():
    ages = df.loc[mask, 'Age'].dropna()
    stats[k] = {'count': int(mask.sum()), 'mean_age': float(ages.mean()) if not ages.empty else None}

pd.DataFrame.from_dict(stats, orient='index')[['count', 'mean_age']]
# ...existing code...

         count   mean_age
Mr         518  32.409774
Mrs        129  35.642857
Miss       182  21.773973
Master      40   4.574167
Dr           7  42.000000
Neither     64  19.418136

In [34]:
df[df['Age'].notnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeCategory,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Young Adult,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Young Adult,Miss
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,Mrs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,Adult,Mrs
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Adult,Neither
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,Young Adult,Miss
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,Young Adult,Mr
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Adult,Mr

In [ ]:
# First, filter only rows with non-null Age
filtered_df = df[df['Age'].notnull()]

# Then, count survivors (Survived == 1) in each AgeCategory
survivor_counts = filtered_df[filtered_df['Survived'] == 1]['AgeCategory'].value_counts()

# Compare survivors vs non-survivors per category (warning-free)
survival_summary = (
    filtered_df.groupby('AgeCategory', observed=True)['Survived']
    .value_counts()
    .unstack(fill_value=0)
)

print("=== Survivors by AgeCategory ===")
print(survivor_counts.to_string())

print("\n=== Full survival summary (0 = died, 1 = survived) ===")
print(survival_summary)

=== Survivors by AgeCategory ===
AgeCategory
Adult          105
Young Adult     69
Senior          55
Baby            31
Teenager        19
Kid             11
Unknown          0

=== Full survival summary (0 = died, 1 = survived) ===
Survived       0    1
AgeCategory
Baby          13   31
Kid           16   11
Teenager      23   19
Young Adult  137   69
Adult        140  105
Senior        95   55